
/* FRAME kind */
#define FRAME_DATA 1//帧种类为数据帧
#define FRAME_ACK  2//帧种类为ACK帧
#define FRAME_NAK  3//帧种类为NAK帧

/*  
    DATA Frame
    +=========+========+========+===============+========+
    | KIND(1) | SEQ(1) | ACK(1) | DATA(240~256) | CRC(4) |
    +=========+========+========+===============+========+

    ACK Frame
    +=========+========+========+
    | KIND(1) | ACK(1) | CRC(4) |
    +=========+========+========+

    NAK Frame
    +=========+========+========+
    | KIND(1) | ACK(1) | CRC(4) |
    +=========+========+========+
*/


